app/controllers/notifications_controller.rb

  def index
    @notifications = Notification.all
---
SELECT "notifications".* FROM "notifications"

  def show
    @notification.update(status: 1)
---
UPDATE "notifications" SET "status" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["status", true], ["updated_at", "2018-12-06 13:47:54.964966"], ["id", 74]]

  def create
    @notification = Notification.new(notification_params)
    respond_to do |format|
      @notification.status = 0
      if @notification.save
        format.html { redirect_to notifications_path, notice: 'Notification was successfully created.' }
        format.json { render :show, status: :created, location: @notification }

        ActionCable.server.broadcast 'notifications_channel', value: @notification, time_ago: time_ago_in_words(@notification.created_at), count: Notification.all.count, url: notification_path(@notification), unread_notification: Notification.where(status: 0).count
---
INSERT INTO "notifications" ("title", "description", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asd"], ["description", "dasads"], ["status", false], ["created_at", "2018-12-06 07:52:52.012056"], ["updated_at", "2018-12-06 07:52:52.012056"]]
SELECT "notifications".* FROM "notifications" WHERE "notifications"."status" = $1  [["status", false]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."status" = $1  [["status", false]]

  def update
    respond_to do |format|
      if @notification.update(notification_params)
---
UPDATE "notifications" SET "status" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["status", false], ["updated_at", "2018-11-20 05:06:59.325424"], ["id", 19]]

  def destroy
    @notification.destroy
---
DELETE FROM "notifications" WHERE "notifications"."id" = $1  [["id", 65]]

  def status
    notification = Notification.find_by_id(params['id'])
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]

  def change_status
    notification = Notification.find_by_id(params['id'])
    notification.status ? notification.update(status: 0) : notification.update(status: 1)
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
UPDATE "notifications" SET "status" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["status", false], ["updated_at", "2018-12-06 11:19:21.929098"], ["id", 63]]

  def set_notification
    @notification = Notification.find(params[:id])
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]