app/controllers/students_controller.rb

  def create
    @student = current_user.students.new(student_params)
    respond_to do |format|
      if @student.save
        format.html { redirect_to @student, notice: 'Student was successfully created.' }
        format.json { render :show, status: :created, location: @student }
      else
        format.html { render :new }
        format.json { render json: @student.errors, status: :unprocessable_entity }
      end
    end
    ActionCable.server.broadcast 'web_notifications_channel', message: current_user.students.count
---
INSERT INTO "students" ("name", "roll_number", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sdf"], ["roll_number", "fsdsfdsfd"], ["created_at", "2018-08-29 10:07:13.611175"], ["updated_at", "2018-08-29 10:07:13.611175"], ["user_id", 2]]
SELECT COUNT(*) FROM "students" WHERE "students"."user_id" = $1  [["user_id", 2]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "roll_number" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["roll_number", "58585855"], ["updated_at", "2018-08-29 05:33:24.479723"], ["id", 1]]