app/views/layouts/application.html.erb

SELECT COUNT(*) FROM "students" WHERE "students"."user_id" = $1  [["user_id", 2]]
SELECT "notifications".* FROM "notifications"
---
              <li>
                <a class="glyphicon glyphicon-bell" style="font-size:15px;color:white" id="notification-count"> students <%= current_user.students.count %></a>

SELECT "notifications".* FROM "notifications"
SELECT COUNT(*) FROM "notifications"
---
            <% end %>
            <li class="dropdown"><a class="dropdown-toggle" data-toggle="dropdown" href="#">Notifications(<strong id="notification_count"><%= Notification.all.count %></strong>)<span class="caret"></span></a>
              <ul class="dropdown-menu" id="notification">
                <% Notification.all.reverse.each do |notification| %>